var ventureData = [
  {
    name: "布连",
    value: [
      109.989917,
      39.375948,
      173183,
      4716373,
      "国电建投内蒙古能源有限公司布连电厂"
    ]
  },
  {
    name: "东胜",
    value: [109.96841, 39.827987, 83372, 3285193, "国电内蒙古东胜热电有限公司"]
  },
  {
    name: "庄河",
    value: [
      122.970471,
      39.687844,
      -111057,
      3862429,
      "国电电力大连庄河发电有限责任公司"
    ]
  },
  {
    name: "大开厂",
    value: [
      121.870189,
      39.068852,
      28654,
      2850693,
      "国电电力发展股份有限公司大连开发区热电厂"
    ]
  },
  {
    name: "大同二发",
    value: [
      113.508677,
      40.096266,
      381060,
      5223110,
      "国电电力发展股份有限公司大同第二发电厂"
    ]
  },
  {
    name: "大同发电",
    value: [
      113.009339,
      40.008605,
      493376,
      11277066,
      "国电电力大同发电有限责任公司"
    ]
  },
  {
    name: "邯郸股份",
    value: [114.525663, 36.648644, 183712, 2582406, "河北邯郸热电股份有限公司"]
  },
  {
    name: "邯郸热电",
    value: [
      114.544804,
      36.638464,
      96172,
      1363642,
      "国电电力发展股份有限公司邯郸热电厂"
    ]
  },
  {
    name: "酒泉",
    value: [98.417374, 39.769154, 121314, 2041016, "国电电力酒泉发电有限公司"]
  },
  {
    name: "石嘴山发电",
    value: [
      106.289599,
      39.591193,
      -128202,
      6188213,
      "国电宁夏石嘴山发电有限责任公司"
    ]
  },
  {
    name: "石嘴山一发",
    value: [107.236631, 39.52595, 56873, 2909327, "国电石嘴山第一发电有限公司"]
  },
  {
    name: "大武口",
    value: [107.006631, 39.05595, 345040, 3661766, "国电大武口热电有限公司"]
  },
  {
    name: "宣威",
    value: [104.108126, 26.226635, -59232, 1341153, "国电宣威发电有限责任公司"]
  },
  {
    name: "北仑一发",
    value: [
      121.548851,
      29.905661,
      -196911,
      4798726,
      "国电浙江北仑第一发电有限公司"
    ]
  },
  {
    name: "北仑三发",
    value: [
      121.864949,
      29.355556,
      239510,
      7996607,
      "国电浙江北仑第三发电有限公司"
    ]
  },
  {
    name: "英力特",
    value: [
      106.029599,
      39.201193,
      -238290,
      1728215,
      "宁夏英力特化工股份有限公司热电分公司"
    ]
  },
  {
    name: "克拉玛依",
    value: [84.87118, 45.594958, -92590, 2126518, "国电克拉玛依发电有限公司"]
  },
  {
    name: "红雁池",
    value: [87.631054, 43.738425, -89408, 2010645, "国电新疆红雁池发电有限公司"]
  },
  {
    name: "库车",
    value: [82.982832, 41.731201, 139458, 2010645, "国电库车发电有限公司"]
  },
  {
    name: "哈密",
    value: [93.521215, 42.830902, -167284, 4289528, "国电哈密发电有限公司"]
  },

  { name: "蚌埠", value: [117.38, 32.92, 0, 0, "国电蚌埠发电有限公司"] },
  { name: "铜陵", value: [117.82, 30.93, 0, 0, "国电铜陵发电有限公司"] },
  { name: "宿州", value: [116.98, 33.63, 0, 0, "国电宿州第二热电有限公司"] },
  { name: "泉州", value: [118.67, 24.88, 0, 0, "国电泉州热电有限公司"] },
  { name: "福州", value: [119.3, 26.08, 0, 0, "国电福州发电有限公司"] },
  {
    name: "肇庆",
    value: [112.47, 23.05, -24812, 2529327, "国电肇庆热电有限公司"]
  },
  { name: "永福", value: [109.98, 24.98, 0, 0, "国电永福发电有限公司"] },
  { name: "南宁", value: [108.37, 22.82, 0, 0, "国电南宁发电有限责任公司"] },
  { name: "安顺发电", value: [105.95, 26.25, 0, 0, "国电安顺发电有限公司"] },
  {
    name: "安顺二发",
    value: [105.85, 26.35, 0, 0, "国电安顺第二发电有限公司"]
  },
  { name: "都匀", value: [107.53, 26.72, 0, 0, "国电都匀发电有限公司"] },
  { name: "乐东", value: [109.17, 18.73, 0, 0, "国电乐东发电有限公司"] },
  { name: "宝庆", value: [111.5, 27.22, 0, 0, "国电湖南宝庆煤电有限公司"] },
  { name: "九江", value: [115.97, 29.71, 0, 0, "国电九江发电有限公司"] },
  { name: "丰城", value: [115.7, 28.19, 0, 0, "国电丰城发电有限公司"] },
  { name: "黄金埠", value: [117.97, 28.47, 0, 0, "国电黄金埠发电有限公司"] },
  { name: "金堂", value: [104.32, 30.88, 0, 0, "国电成都金堂发电有限公司"] },
  {
    name: "华蓥山",
    value: [106.97, 30.83, 0, 0, "国电深能四川华蓥山发电有限公司"]
  },
  { name: "达州", value: [107.48, 31.22, 0, 0, "国电达州发电有限公司"] },
  { name: "阳宗海", value: [103.15, 24.92, 0, 0, "国电阳宗海发电有限公司"] },
  { name: "开远", value: [103.23, 23.7, 0, 0, "国电开远发电有限公司"] },
  { name: "恒泰", value: [105.91, 29.38, 0, 0, "国电重庆恒泰发电有限公司"] },

  {
    name: "荆门",
    value: [112.19, 31.02, -55000, 4000000, "国电长源荆门发电有限公司"]
  },
  {
    name: "荆州",
    value: [112.23, 30.33, -75300, 2596000, "国电长源荆州热电有限公司"]
  },
  {
    name: "汉川一发",
    value: [113.59, 30.63, 17000, 4440000, "国电长源汉川第一发电有限公司"]
  },
  {
    name: "汉川发电",
    value: [113.65, 30.63, -51400, 3840000, "国电汉川发电有限公司"]
  },
  {
    name: "长源一发",
    value: [114.38, 30.63, -47600, 1356700, "国电长源第一发电有限责任公司"]
  },
  {
    name: "青山",
    value: [114.38, 30.52, 101000, 2765000, "国电青山热电有限公司"]
  },
  { name: "沈阳厂", value: [123.38, 41.8, 0, 0, "沈阳热电厂"] },
  { name: "康平", value: [123.33, 42.75, 0, 0, "国电康平发电有限公司"] },
  { name: "沈阳热电", value: [123.38, 41.4, 0, 0, "国电沈阳热电有限公司"] },
  {
    name: "双辽厂",
    value: [123.5, 43.52, 0, 0, "国电东北发电有限公司双辽发电厂"]
  },
  { name: "双辽公司", value: [123.5, 43.4, 0, 0, "国电双辽发电有限公司"] },
  { name: "江南", value: [126.57, 43.82, 0, 0, "国电吉林江南热电有限公司"] },
  {
    name: "吉林热电",
    value: [126.55, 43.83, 0, 0, "国电吉林龙华热电股份有限公司—吉林热电厂"]
  },
  {
    name: "长春热电",
    value: [125.35, 43.88, 0, 0, "国电吉林龙华热电股份有限公司—长春热电一厂"]
  },
  { name: "延吉", value: [129.52, 42.93, 0, 0, "国电龙华延吉热电有限公司"] },
  {
    name: "白城",
    value: [122.82, 45.63, 0, 0, "国电吉林龙华热电股份有限公司—白城热电厂"]
  },
  { name: "和龙", value: [129.0, 42.52, 0, 0, "国电龙华和龙热力有限责任公司"] },
  {
    name: "蛟河",
    value: [127.33, 43.75, 0, 0, "国电吉林龙华热电股份有限公司—蛟河热电厂"]
  },
  { name: "双鸭山", value: [131.17, 46.65, 0, 0, "国电双鸭山发电有限公司"] },
  { name: "北安", value: [126.5, 48.22, 0, 0, "国电北安热电有限公司"] },
  { name: "哈尔滨", value: [126.63, 45.75, 0, 0, "国电哈尔滨热电有限公司"] },
  { name: "靖远", value: [104.71, 36.54, 0, 0, "国电靖远发电有限公司"] },
  { name: "范坪", value: [103.62, 36.1, 0, 0, "国电兰州范坪热电有限公司"] },
  {
    name: "兰州热电",
    value: [103.82, 36.07, 0, 0, "国电兰州热电有限责任公司"]
  },
  { name: "豫源", value: [112.57, 35.08, 0, 0, "国电豫源发电有限责任公司"] },
  { name: "濮阳", value: [114.98, 35.71, 0, 0, "国电濮阳热电有限公司"] },
  { name: "驻马店", value: [114.02, 32.98, 0, 0, "国电驻马店热电有限公司"] },
  { name: "民权", value: [115.13, 34.65, 0, 0, "国电民权发电有限公司"] },
  { name: "荥阳", value: [113.35, 34.79, 0, 0, "国电荥阳煤电一体化有限公司"] },
  { name: "承德", value: [117.93, 40.97, 0, 0, "国电承德热电有限公司"] },
  { name: "滦河", value: [117.78, 40.95, 0, 0, "国电滦河热电有限公司"] },
  { name: "衡丰", value: [115.72, 37.72, 0, 0, "河北衡丰发电有限责任公司"] },
  { name: "怀安", value: [114.38, 40.67, 0, 0, "国电怀安热电有限公司"] },
  {
    name: "龙山",
    value: [113.67, 36.57, 0, 0, "国电河北龙山发电有限责任公司"]
  },
  { name: "津能热电", value: [117.3, 39.08, 0, 0, "天津国电津能热电有限公司"] },
  {
    name: "滨海热电",
    value: [117.68, 39.03, 0, 0, "天津国电津能滨海热电有限公司"]
  },
  { name: "滨海电力", value: [117.65, 39.02, 0, 0, "天津滨海电力有限公司"] },
  {
    name: "太原",
    value: [112.53, 37.87, 0, 0, "中国国电集团公司太原第一热电厂"]
  },
  { name: "太一", value: [112.48, 37.73, 0, 0, "国电太一发电有限责任公司"] },
  { name: "榆次", value: [112.72, 37.68, 0, 0, "国电榆次热电有限公司"] },
  { name: "霍州", value: [111.72, 36.57, 0, 0, "中国国电集团公司霍州发电厂"] },
  { name: "谏壁厂", value: [119.44, 32.2, 0, 0, "中国国电集团公司谏壁发电厂"] },
  { name: "谏壁发电", value: [119.34, 32.2, 0, 0, "国电江苏谏壁发电有限公司"] },
  { name: "常州", value: [119.95, 31.79, 0, 0, "国电常州发电有限公司"] },
  { name: "泰州", value: [119.9, 32.49, 0, 0, "国电泰州发电有限公司"] },
  { name: "宿迁", value: [118.3, 33.96, 0, 0, "国电宿迁热电有限公司"] },
  { name: "江阴", value: [120.26, 31.91, 0, 0, "江阴苏龙热电有限公司"] },
  { name: "天生港", value: [121.05, 32.08, 0, 0, "南通天生港发电有限公司"] },
  {
    name: "石横厂",
    value: [116.76, 36.24, 0, 0, "山东中华发电有限公司石横发电厂"]
  },
  { name: "石横公司", value: [116.76, 36.04, 0, 0, "国电石横发电有限公司"] },
  {
    name: "聊城厂",
    value: [115.97, 36.45, 0, 0, "山东中华发电有限公司聊城发电厂"]
  },
  { name: "聊城公司", value: [115.97, 36.65, 0, 0, "国电聊城发电有限公司"] },
  { name: "费县", value: [117.97, 35.26, 0, 0, "国电费县发电有限公司"] },
  {
    name: "菏泽厂",
    value: [115.56, 34.45, 0, 0, "山东中华发电有限公司菏泽发电厂"]
  },
  { name: "菏泽公司", value: [115.2, 34.45, 0, 0, "国电菏泽发电有限公司"] },
  { name: "蓬莱", value: [120.75, 37.8, 0, 0, "国电蓬莱发电有限公司"] },
  { name: "泰安", value: [117.13, 36.18, 0, 0, "国电泰安热电有限公司"] },
  {
    name: "宝鸡二发",
    value: [107.15, 34.38, 0, 0, "国电宝鸡第二发电有限责任公司"]
  },
  { name: "宝鸡公司", value: [107.15, 34.2, 0, 0, "国电宝鸡发电有限责任公司"] },
  { name: "元宝山", value: [119.28, 42.03, 0, 0, "元宝山发电有限责任公司"] }
];

var homePage = {
  daySaleData: {
    today: [
      { hour: "0", data: 3779.194 },
      { hour: "1", data: 7829.646000000001 },
      { hour: "2", data: 11639.915 },
      { hour: "3", data: 15271.553 },
      { hour: "4", data: 18533.059 },
      { hour: "5", data: 21817.439000000002 },
      { hour: "6", data: 25403.084000000003 },
      { hour: "7", data: 28402.111000000004 },
      { hour: "8", data: 32732.602000000006 },
      { hour: "9", data: 37275.708000000006 },
      { hour: "10", data: 37944.27100000001 }
    ],
    yestoday: [
      { hour: "0", data: 4010.646 },
      { hour: "1", data: 7928.374 },
      { hour: "2", data: 11653.723 },
      { hour: "3", data: 15297.336 },
      { hour: "4", data: 18769.581 },
      { hour: "5", data: 22369.632999999998 },
      { hour: "6", data: 26806.971999999998 },
      { hour: "7", data: 31419.345999999998 },
      { hour: "8", data: 37147.653999999995 },
      { hour: "9", data: 43520.39199999999 },
      { hour: "10", data: 49564.83899999999 },
      { hour: "11", data: 55450.835999999996 },
      { hour: "12", data: 60273.64199999999 },
      { hour: "13", data: 65217.166999999994 },
      { hour: "14", data: 69748.181 },
      { hour: "15", data: 74027.231 },
      { hour: "16", data: 78741.085 },
      { hour: "17", data: 83037.391 },
      { hour: "18", data: 87455.32400000001 },
      { hour: "19", data: 91944.15900000001 },
      { hour: "20", data: 96682.77300000002 },
      { hour: "21", data: 101030.91800000002 },
      { hour: "22", data: 104984.32000000002 },
      { hour: "23", data: 108928.23700000002 }
    ],
    theDayLastMonth: [
      { hour: "0", data: 4878.738 },
      { hour: "1", data: 9132.152 },
      { hour: "2", data: 13008.15 },
      { hour: "3", data: 16726.001 },
      { hour: "4", data: 20563.709 },
      { hour: "5", data: 25395.154 },
      { hour: "6", data: 30931.636 },
      { hour: "7", data: 36509.409999999996 },
      { hour: "8", data: 43085.55099999999 },
      { hour: "9", data: 49046.27999999999 },
      { hour: "10", data: 54964.325999999994 },
      { hour: "11", data: 61283.02799999999 },
      { hour: "12", data: 66614.48199999999 },
      { hour: "13", data: 73236.59499999999 },
      { hour: "14", data: 80128.08099999999 },
      { hour: "15", data: 86932.03199999999 },
      { hour: "16", data: 93733.548 },
      { hour: "17", data: 100287.076 },
      { hour: "18", data: 107320.712 },
      { hour: "19", data: 114437.88 },
      { hour: "20", data: 121356.364 },
      { hour: "21", data: 128163.774 },
      { hour: "22", data: 134490.711 },
      { hour: "23", data: 139921.196 }
    ],
    theDayLastYear: [
      { hour: "0", data: 1277.749 },
      { hour: "1", data: 2971.239 },
      { hour: "2", data: 4386.2880000000005 },
      { hour: "3", data: 5497.484 },
      { hour: "4", data: 6552.909000000001 },
      { hour: "5", data: 7793.268 },
      { hour: "6", data: 9920.017 },
      { hour: "7", data: 11848.103 },
      { hour: "8", data: 14166.32 },
      { hour: "9", data: 15931.289999999999 },
      { hour: "10", data: 17761.011 },
      { hour: "11", data: 20576.774999999998 },
      { hour: "12", data: 22248.534 },
      { hour: "13", data: 24189.611 },
      { hour: "14", data: 26349.766 },
      { hour: "15", data: 28020.22 },
      { hour: "16", data: 30028.45 },
      { hour: "17", data: 32978.601 },
      { hour: "18", data: 35355.880000000005 },
      { hour: "19", data: 37185.69 },
      { hour: "20", data: 38832.644 },
      { hour: "21", data: 40143.666 },
      { hour: "22", data: 41518.547999999995 },
      { hour: "23", data: 43388.706 }
    ],
    plan: 0.0
  },

  percentData: {
      "1月": {
          huanbi: "12",
          tongbi: "13"
      },
      "2月": {
        huanbi: "10",
        tongbi: "9"
      },
      "3月": {
        huanbi: "12",
        tongbi: "15"
      },
      "4月": {
        huanbi: "9",
        tongbi: "14"
      },
      "5月": {
        huanbi: "10",
        tongbi: "10"
      }
  },

  targetData: {
    "dataThisMonth": 2577936.083,
    "dataLastMonth": 3854781.801,
    "dataTheMonthLastYear": 2003657.222,
    "planThisMonth": 310000
  }
};
